app/views/courses/show.html.erb


        <% @course.lessons.each do |lesson| %>
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = ?  [["course_id", "1"]]