app/views/courses/show.html.erb

      <div class="course-content">
        <% @course.lessons.each do |lesson| %>
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = ?  [["course_id", "1"]]